## Mini Project One

In [1]:
import pandas as pd

In [ ]:
reading the file

In [2]:
df= pd.read_csv('data.csv')
df

                  city  Temperature_C  Humidity Condition
0    01/01/25 Hyderbad           21.0      60.0       NaN
1    01/01/25 Hyderbad           21.0      50.0    cloudy
2    01/01/25 Hyderbad            NaN      40.0       NaN
3    01/01/25 Hyderbad           32.0      30.0    cloudy
4    01/01/25 Hyderbad           67.0      60.0       NaN
5    01/01/25 Hyderbad           34.0       NaN    cloudy
6    01/01/25 Hyderbad            NaN      45.0    cloudy
7    01/01/25 Hyderbad           32.0       NaN    cloudy
8    01/01/25 Hyderbad           45.0      34.0     sunny
9    01/01/25 Hyderbad           54.0      23.0     sunny
10   01/01/25 Hyderbad            NaN      67.0    cloudy

In [3]:
df.isnull()

     city  Temperature_C  Humidity  Condition
0   False          False     False       True
1   False          False     False      False
2   False           True     False       True
3   False          False     False      False
4   False          False     False       True
5   False          False      True      False
6   False           True     False      False
7   False          False      True      False
8   False          False     False      False
9   False          False     False      False
10  False           True     False      False

In [ ]:
Exploring data

In [6]:
df.head()

                 city  Temperature_C  Humidity Condition
0   01/01/25 Hyderbad           21.0      60.0       NaN
1   01/01/25 Hyderbad           21.0      50.0    cloudy
2   01/01/25 Hyderbad            NaN      40.0       NaN
3   01/01/25 Hyderbad           32.0      30.0    cloudy
4   01/01/25 Hyderbad           67.0      60.0       NaN

In [7]:
df.tail()

                  city  Temperature_C  Humidity Condition
6    01/01/25 Hyderbad            NaN      45.0    cloudy
7    01/01/25 Hyderbad           32.0       NaN    cloudy
8    01/01/25 Hyderbad           45.0      34.0     sunny
9    01/01/25 Hyderbad           54.0      23.0     sunny
10   01/01/25 Hyderbad            NaN      67.0    cloudy

In [12]:
df['Temperature_C']=df['Temperature_C'].fillna(df['Temperature_C'].mean())
df

                  city  Temperature_C  Humidity Condition
0    01/01/25 Hyderbad          21.00      60.0       NaN
1    01/01/25 Hyderbad          21.00      50.0    cloudy
2    01/01/25 Hyderbad          38.25      40.0       NaN
3    01/01/25 Hyderbad          32.00      30.0    cloudy
4    01/01/25 Hyderbad          67.00      60.0       NaN
5    01/01/25 Hyderbad          34.00       NaN    cloudy
6    01/01/25 Hyderbad          38.25      45.0    cloudy
7    01/01/25 Hyderbad          32.00       NaN    cloudy
8    01/01/25 Hyderbad          45.00      34.0     sunny
9    01/01/25 Hyderbad          54.00      23.0     sunny
10   01/01/25 Hyderbad          38.25      67.0    cloudy

In [13]:
df['Humidity']=df['Humidity'].fillna(df['Humidity'].sum())

In [14]:
df

                  city  Temperature_C  Humidity Condition
0    01/01/25 Hyderbad          21.00      60.0       NaN
1    01/01/25 Hyderbad          21.00      50.0    cloudy
2    01/01/25 Hyderbad          38.25      40.0       NaN
3    01/01/25 Hyderbad          32.00      30.0    cloudy
4    01/01/25 Hyderbad          67.00      60.0       NaN
5    01/01/25 Hyderbad          34.00     409.0    cloudy
6    01/01/25 Hyderbad          38.25      45.0    cloudy
7    01/01/25 Hyderbad          32.00     409.0    cloudy
8    01/01/25 Hyderbad          45.00      34.0     sunny
9    01/01/25 Hyderbad          54.00      23.0     sunny
10   01/01/25 Hyderbad          38.25      67.0    cloudy

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   city           11 non-null     object
 1   Temperature_C  11 non-null     float64
 2   Humidity       11 non-null     float64
 3   Condition      8 non-null      object
dtypes: float64(2), object(2)
memory usage: 484.0+ bytes

In [17]:
df.shape

(11, 4)

In [18]:
df[2:6]

                 city  Temperature_C  Humidity Condition
2   01/01/25 Hyderbad          38.25      40.0       NaN
3   01/01/25 Hyderbad          32.00      30.0    cloudy
4   01/01/25 Hyderbad          67.00      60.0       NaN
5   01/01/25 Hyderbad          34.00     409.0    cloudy

In [19]:
df.columns

Index(['city', 'Temperature_C', 'Humidity', 'Condition'], dtype='object')

In [20]:
df.index

RangeIndex(start=0, stop=11, step=1)

In [21]:
df.dtypes

city              object
Temperature_C    float64
Humidity         float64
Condition         object
dtype: object

In [23]:
df.city

0      01/01/25 Hyderbad
1      01/01/25 Hyderbad
2      01/01/25 Hyderbad
3      01/01/25 Hyderbad
4      01/01/25 Hyderbad
5      01/01/25 Hyderbad
6      01/01/25 Hyderbad
7      01/01/25 Hyderbad
8      01/01/25 Hyderbad
9      01/01/25 Hyderbad
10     01/01/25 Hyderbad
Name: city, dtype: object

In [25]:
df[['city','Humidity']]

                  city  Humidity
0    01/01/25 Hyderbad      60.0
1    01/01/25 Hyderbad      50.0
2    01/01/25 Hyderbad      40.0
3    01/01/25 Hyderbad      30.0
4    01/01/25 Hyderbad      60.0
5    01/01/25 Hyderbad     409.0
6    01/01/25 Hyderbad      45.0
7    01/01/25 Hyderbad     409.0
8    01/01/25 Hyderbad      34.0
9    01/01/25 Hyderbad      23.0
10   01/01/25 Hyderbad      67.0

In [27]:
df['city'][df['Condition']=='sunny']

8     01/01/25 Hyderbad
9     01/01/25 Hyderbad
Name: city, dtype: object

In [ ]:
creating the dataset

In [34]:
df = pd.DataFrame({
    "name":[ "Pavan", "Kumar", "Anil", "Ravi", "Suresh","Mahesh", "Rohit", "Amit", "Vijay", "Arjun"],
    "age": [25, 23, 28 , 0,27,26, 24, 29, 31, 22]
})

In [29]:
df

     name  age
0   Pavan   25
1   Kumar   23
2    Anil   28
3    Ravi   30
4  Suresh   27
5  Mahesh   26
6   Rohit   24
7    Amit   29
8   Vijay   31
9   Arjun   22

In [30]:
df.isnull()

    name    age
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
5  False  False
6  False  False
7  False  False
8  False  False
9  False  False

In [31]:
df.head()

     name  age
0   Pavan   25
1   Kumar   23
2    Anil   28
3    Ravi   30
4  Suresh   27

In [35]:
df.tail()

     name  age
5  Mahesh   26
6   Rohit   24
7    Amit   29
8   Vijay   31
9   Arjun   22

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    10 non-null     object
 1   age     10 non-null     int64
dtypes: int64(1), object(1)
memory usage: 292.0+ bytes

In [37]:
df.shape

(10, 2)

In [ ]:
Give